:PROPERTIES:
:ID:       5aa36ac8-32b3-421f-afb1-5b6292b06915
:END:
#+title: VyOS
#+AUTHOR:    David Conner
#+EMAIL:     noreply@te.xel.io
#+DESCRIPTION: notes
Is it feasible to blacklist all users from being able to view some of the configuration files?

i.e. when users run `show config`, is it directly accessing & running gunzip to

The

The `acl` package and its commands are not on a default ISO.

VyOS has =nftables= and a decent DSL with fairly good ansible support.

+ +The DSL+ Some significant part of VyOS is implemented in OCaml.
+ It only supports x86 for now.
+ It's missing some of the plug-in functionality of OPNsense (packet/traffic
  inspection), but has the ability to run images in containers with
  routing/firewall on the container host. So you could set up a container to do
  much of what the PFSense and OPNsense ecosystem allows (see the [[https://docs.vyos.io/en/stable/configuration/container/index.html#example-configuration][Zabbix
  container example]])

** From A Live ISO

#+name: tmpdir
#+begin_src sh :cache yes
mktemp -d
#+end_src

#+RESULTS[d11bbe9264aafab22d88733f2c0f56e64bc0e8a9]: tmpdir
: /tmp/tmp.FGNzBW0pUI

*** Kernel


Fetch =/proc/config.gz=, then =gunzip=

#+begin_example shell
# this works, but tramp completion is problematic -- emacs close to locking :(
# +begin_src shell :dir /ssh:vyostest:/home/vyos :results output file :file img/vyos.kconfig
cat /proc/config.gz | gunzip -c
#+end_example

Just use scp

#+begin_src shell :var d=tmpdir
scp vyostest:/proc/config.gz $d
#+end_src

Run =gunzip= and save to =kconfig=

#+begin_src shell :var d=tmpdir
# total lines: 6390. without commented or empty lines: 3309
cat $d/kconfig | grep -v '^#' | grep -ve '^$' | wc -l
#+end_src

#+RESULTS:
: 3309

Whereas for this hsot arch zen kernel, there are =9386= positively-defined kconfig
settings (and =12192= total).

***** Directories

Without vyos-1x, cache or chroot directories, the file structure is compact

#+begin_src shell :results output verbatim :dir /data/ecto/vyos/vyos/vyos-build
tree -dI vyos-1x -I cache -I chroot build
#+end_src

#+RESULTS:
#+begin_example
build
├── auto
├── binary
│   ├── boot
│   │   └── grub
│   │       ├── live-theme
│   │       └── x86_64-efi
│   ├── EFI
│   │   └── boot
│   ├── isolinux
│   └── live
├── config
│   ├── apt
│   ├── archives
│   ├── bootloaders
│   │   └── grub-pc
│   │       └── live-theme
│   ├── debian-installer
│   ├── hooks
│   │   ├── live
│   │   └── normal
│   ├── includes
│   ├── includes.binary
│   │   └── isolinux
│   ├── includes.bootstrap
│   ├── includes.chroot
│   │   ├── etc
│   │   │   ├── initramfs-tools
│   │   │   │   └── hooks
│   │   │   ├── modprobe.d
│   │   │   ├── modules-load.d
│   │   │   ├── sudoers.d
│   │   │   └── systemd
│   │   │       └── system
│   │   │           └── getty@tty1.service.d
│   │   ├── opt
│   │   │   └── vyatta
│   │   │       └── etc
│   │   │           ├── grub
│   │   │           └── install-image
│   │   ├── usr
│   │   │   └── share
│   │   │       └── vyos
│   │   │           └── keys
│   │   └── var
│   │       └── lib
│   │           └── shim-signed
│   │               └── mok
│   ├── includes.chroot_after_packages
│   ├── includes.chroot_before_packages
│   ├── includes.installer
│   ├── includes.source
│   ├── package-lists
│   ├── packages
│   ├── packages.binary
│   ├── packages.chroot
│   ├── preseed
│   └── rootfs
└── local
    └── bin

60 directories
#+end_example

*** Default Profiles

There are several profiles to build, each with a =config.boot.default=, though
some of the profiles below are CI/CD (not in the =vyos-build= project)

#+begin_src shell :results output verbatim
locate '/data/ecto/vyos*vyos*config*default' \
    | sed -e 's/\/data\/ecto\/vyos\/vyos\///g'  \
    | tree --fromfile .
#+end_src

#+RESULTS:
#+begin_example
.
├── gh-action-test-vyos-1x
│   ├── data
│   │   └── config.boot.default
│   └── tests
│       └── data
│           └── config.boot.default
├── vyos
│   └── configs
│       └── etc
│           └── vyos
│               └── config.boot.default
├── vyos-1x
│   ├── data
│   │   └── config.boot.default
│   └── tests
│       └── data
│           └── config.boot.default
├── vyos-build
│   ├── build
│   │   └── vyos-1x
│   │       ├── data
│   │       │   └── config.boot.default
│   │       └── tests
│   │           └── data
│   │               └── config.boot.default
│   └── tools
│       ├── cloud-init
│       │   └── AWS
│       │       └── config.boot.default
│       └── container
│           └── config.boot.default
└── vyos-workflow-test-temp
    ├── data
    │   └── config.boot.default
    └── tests
        └── data
            └── config.boot.default

27 directories, 11 files
#+end_example

*** Jinja Templates

#+begin_src shell :results output verbatim
find -name 'nftables*.j2' -type f -printf '%p\n' \
    | tee -a >(echo ./data/templates/firewall/sysctl-firewall.conf.j2) \
    | sed -e 's/^.\///g' \
    | tree --fromfile .
#+end_src

#+RESULTS:
#+begin_example
.
└── data
    └── templates
        ├── conntrack
        │   ├── nftables-ct.j2
        │   └── nftables-helpers.j2
        ├── firewall
        │   ├── nftables-bridge.j2
        │   ├── nftables-cgnat.j2
        │   ├── nftables-defines.j2
        │   ├── nftables-geoip-update.j2
        │   ├── nftables.j2
        │   ├── nftables-nat66.j2
        │   ├── nftables-nat.j2
        │   ├── nftables-offload.j2
        │   ├── nftables-policy.j2
        │   ├── nftables-static-nat.j2
        │   ├── nftables-zone.j2
        │   └── sysctl-firewall.conf.j2
        └── load-balancing
            └── nftables-wlb.j2

6 directories, 15 files
#+end_example

Entry points

#+begin_src shell :results output verbatim
grep -e '#!/usr/sbin/nft' $(find -name 'nftables*.j2' -type f -printf '%p\n' \
    | tee -a >(echo ./data/templates/firewall/sysctl-firewall.conf.j2)) \
    | sed -e 's/.\/data\/templates\///g' \
    | sed -e "s/:#!/ => #!/g"
#+end_src

#+RESULTS:
: conntrack/nftables-ct.j2 => #!/usr/sbin/nft -f
: firewall/nftables-cgnat.j2 => #!/usr/sbin/nft -f
: firewall/nftables-policy.j2 => #!/usr/sbin/nft -f
: firewall/nftables-nat66.j2 => #!/usr/sbin/nft -f
: firewall/nftables.j2 => #!/usr/sbin/nft -f
: firewall/nftables-nat.j2 => #!/usr/sbin/nft -f
: firewall/nftables-static-nat.j2 => #!/usr/sbin/nft -f
: firewall/nftables-geoip-update.j2 => #!/usr/sbin/nft -f
: load-balancing/nftables-wlb.j2 => #!/usr/sbin/nft -f

Imports

#+begin_src shell :results output verbatim
grep -e import $(find -name 'nftables*.j2' -type f -printf '%p\n' \
    | tee -a >(echo ./data/templates/firewall/sysctl-firewall.conf.j2)) \
    | sed -e 's/.\/data\/templates\///g' \
    | sed -e "s/:{% / => /g" | sed -e "s/ %}//g"
#+end_src

#+RESULTS:
#+begin_example
conntrack/nftables-ct.j2 => import 'conntrack/nftables-helpers.j2' as helper_tmpl
conntrack/nftables-ct.j2 => import 'firewall/nftables-defines.j2' as group_tmpl
firewall/nftables-policy.j2 => import 'firewall/nftables-defines.j2' as group_tmpl
firewall/nftables-nat66.j2 => import 'firewall/nftables-defines.j2' as group_tmpl
firewall/nftables.j2 => import 'firewall/nftables-defines.j2' as group_tmpl
firewall/nftables.j2 => import 'firewall/nftables-bridge.j2' as bridge_tmpl
firewall/nftables.j2 => import 'firewall/nftables-offload.j2' as offload_tmpl
firewall/nftables.j2 => import 'firewall/nftables-zone.j2' as zone_tmpl
firewall/nftables-bridge.j2 => import 'firewall/nftables-defines.j2' as group_tmpl
firewall/nftables-nat.j2 => import 'firewall/nftables-defines.j2' as group_tmpl
#+end_example

Macros

#+begin_src shell :results output verbatim
grep -e '{% macro' $(find -name 'nftables*.j2' -type f -printf '%p\n' \
    | tee -a >(echo ./data/templates/firewall/sysctl-firewall.conf.j2)) \
    | sed -e 's/.\/data\/templates\///g' \
    | sed -e "s/:{% / => /g" | sed -e "s/ %}//g"
#+end_src

#+RESULTS:
: conntrack/nftables-helpers.j2 => macro conntrack_helpers(module_map, modules, ipv4=True)
: firewall/nftables-offload.j2 => macro flowtable(name, config)
: firewall/nftables-bridge.j2 => macro bridge(bridge)
: firewall/nftables-defines.j2 => macro groups(group, is_ipv6, is_l3)
: firewall/nftables-zone.j2 => macro zone_chains(zone, ipv6=False, state_policy=False)

Chains

#+begin_src shell :results output verbatim
grep -e 'chain' $(find -name 'nftables*.j2' -type f -printf '%p\n' \
    | tee -a >(echo ./data/templates/firewall/sysctl-firewall.conf.j2)) \
    | sed -e 's/.\/data\/templates\///g' \
    | sed -e "s/:{% / => /g" | sed -e "s/ %}//g"
#+end_src

#+RESULTS:



